CMPE-146-MP3-Labs/Lab-Assignments/projects/lpc40xx_freertos/l5_application/VS1053/player1053.c
/*

  VLSI Solution generic microcontroller example player / recorder for
  VS1053.

  v1.10 2016-05-09 HH  Modified quick sanity check registers
  v1.03 2012-12-11 HH  Recording command 'p' was VS1063 only -> removed
                       Added chip type recognition
  v1.02 2012-12-04 HH  Command '_' incorrectly printed VS1063-specific fields
  v1.01 2012-11-28 HH  Untabified
  v1.00 2012-11-27 HH  First release

*/

#include "FreeRTOS.h"
#include "ff.h"
#include "gpio.h"
#include "lpc40xx.h"
#include "player.h"
#include "semphr.h"
#include "ssp2.h"
#include "task.h"
#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
/* Download the latest VS1053a Patches package and its
   vs1053b-patches-flac.plg. If you want to use the smaller patch set
   which doesn't contain the FLAC decoder, use vs1053b-patches.plg instead.
   The patches package is available at
   http://www.vlsi.fi/en/support/software/vs10xxpatches.html */
#include "lpc_peripherals.h"
#include "vs1053b-patches-flac.plg"

/* We also want to have the VS1053b Ogg Vorbis Encoder plugin. To get more
   than one plugin included, we'll have to include it in a slightly more
   tricky way. To get the plugin included below, download the latest version
   of the VS1053 Ogg Vorbis Encoder Application from
   http://www.vlsi.fi/en/support/software/vs10xxapplications.html */
#define SKIP_PLUGIN_VARNAME
const u_int16 encoderPlugin[] = {
#include "venc44k2q05.plg"
};
#undef SKIP_PLUGIN_VARNAME

/* VS1053b IMA ADPCM Encoder Fix, available at
   http://www.vlsi.fi/en/support/software/vs10xxpatches.html */
#define SKIP_PLUGIN_VARNAME
const u_int16 imaFix[] = {
#include "imafix.plg"
};
#undef SKIP_PLUGIN_VARNAME

#define FILE_BUFFER_SIZE 512
#define SDI_MAX_TRANSFER_SIZE 32
#define SDI_END_FILL_BYTES_FLAC 12288
#define SDI_END_FILL_BYTES 2050
#define REC_BUFFER_SIZE 512

/* How many transferred bytes between collecting data.
   A value between 1-8 KiB is typically a good value.
   If REPORT_ON_SCREEN is defined, a report is given on screen each time
   data is collected. */
#define REPORT_INTERVAL 4096
#define REPORT_INTERVAL_MIDI 512
#if 0
#define REPORT_ON_SCREEN
#endif

/* Define PLAYER_USER_INTERFACE if you want to have a user interface in your
   player. */
#if 0
#define PLAYER_USER_INTERFACE
#endif

/* Define RECORDER_USER_INTERFACE if you want to have a user interface in your
   player. */
#if 0
#define RECORDER_USER_INTERFACE
#endif

#define min(a, b) (((a) < (b)) ? (a) : (b))

enum AudioFormat {
  afUnknown,
  afRiff,
  afOggVorbis,
  afMp1,
  afMp2,
  afMp3,
  afAacMp4,
  afAacAdts,
  afAacAdif,
  afFlac,
  afWma,
  afMidi,
} audioFormat = afUnknown;

const char *afName[] = {
    "unknown", "RIFF",     "Ogg",      "MP1",  "MP2", "MP3",
    "AAC MP4", "AAC ADTS", "AAC ADIF", "FLAC", "WMA", "MIDI",
};

void WriteSci(u_int8 addr, u_int16 data) {
  while (!gpio__get(VS_DREQ)) {
    // wait
  }
  u_int8 dataM = (data >> 8) & 0xFF;
  u_int8 dataL = data & 0xFF;
  gpio__set(VS_DCS);
  gpio__reset(VS_CS);
  ssp0__exchange_byte(0x02);
  ssp0__exchange_byte(addr);
  ssp0__exchange_byte(dataM);
  ssp0__exchange_byte(dataL);
  gpio__set(VS_CS);
}

u_int16 ReadSci(u_int8 addr) {
  while (!gpio__get(VS_DREQ)) {
    // wait
  }
  u_int16 data;
  gpio__set(VS_DCS);
  gpio__reset(VS_CS);
  ssp0__exchange_byte(0x03);
  ssp0__exchange_byte(addr);
  data = ssp0__exchange_byte(0xFF) << 8 | ssp0__exchange_byte(0xFF);
  gpio__set(VS_CS);
  return data;
}
int WriteSdi(const u_int8 *data, u_int8 bytes) {
  while (!gpio__get(VS_DREQ)) {
    // wait
  }
  gpio__set(VS_CS);
  gpio__reset(VS_DCS);
  for (int i = 0; i < bytes; i++) {
    ssp0__exchange_byte(data[i]);
    while (!gpio__get(VS_DREQ)) {
      // wait
    }
  }
  gpio__set(VS_DCS);
  return 0;
}
/*
  Read 32-bit increasing counter value from addr.
  Because the 32-bit value can change while reading it,
  read MSB's twice and decide which is the correct one.
*/
u_int32 ReadVS10xxMem32Counter(u_int16 addr) {
  u_int16 msbV1, lsb, msbV2;
  u_int32 res;

  WriteSci(SCI_WRAMADDR, addr + 1);
  msbV1 = ReadSci(SCI_WRAM);
  WriteSci(SCI_WRAMADDR, addr);
  lsb = ReadSci(SCI_WRAM);
  msbV2 = ReadSci(SCI_WRAM);
  if (lsb < 0x8000U) {
    msbV1 = msbV2;
  }
  res = ((u_int32)msbV1 << 16) | lsb;

  return res;
}

/*
  Read 32-bit non-changing value from addr.
*/
u_int32 ReadVS10xxMem32(u_int16 addr) {
  u_int16 lsb;
  WriteSci(SCI_WRAMADDR, addr);
  lsb = ReadSci(SCI_WRAM);
  return lsb | ((u_int32)ReadSci(SCI_WRAM) << 16);
}

/*
  Read 16-bit value from addr.
*/
u_int16 ReadVS10xxMem(u_int16 addr) {
  WriteSci(SCI_WRAMADDR, addr);
  return ReadSci(SCI_WRAM);
}

/*
  Write 16-bit value to given VS10xx address
*/
void WriteVS10xxMem(u_int16 addr, u_int16 data) {
  WriteSci(SCI_WRAMADDR, addr);
  WriteSci(SCI_WRAM, data);
}

/*
  Write 32-bit value to given VS10xx address
*/
void WriteVS10xxMem32(u_int16 addr, u_int32 data) {
  WriteSci(SCI_WRAMADDR, addr);
  WriteSci(SCI_WRAM, (u_int16)data);
  WriteSci(SCI_WRAM, (u_int16)(data >> 16));
}

static const u_int16 linToDBTab[5] = {36781, 41285, 46341, 52016, 58386};

/*
  Converts a linear 16-bit value between 0..65535 to decibels.
    Reference level: 32768 = 96dB (largest VS1053b number is 32767 = 95dB).
  Bugs:
    - For the input of 0, 0 dB is returned, because minus infinity cannot
      be represented with integers.
    - Assumes a ratio of 2 is 6 dB, when it actually is approx. 6.02 dB.
*/
static u_int16 LinToDB(unsigned short n) {
  int res = 96, i;

  if (!n) /* No signal should return minus infinity */
    return 0;

  while (n < 32768U) { /* Amplify weak signals */
    res -= 6;
    n <<= 1;
  }

  for (i = 0; i < 5; i++) /* Find exact scale */
    if (n >= linToDBTab[i])
      res++;

  return res;
}

/*

