CMPE-146-MP3-Labs/Lab-Assignments/projects/lpc40xx_freertos/l5_application/VS1053/player1053.c
  /* If the file actually ended, and playback cancellation was not
     done earlier, do it now. */
  if (playerState == psPlayback) {
    unsigned short oldMode = ReadSci(SCI_MODE);
    WriteSci(SCI_MODE, oldMode | SM_CANCEL);
    printf("ok. Setting SM_CANCEL, waiting... ");
    fflush(stdout);
    while (ReadSci(SCI_MODE) & SM_CANCEL)
      WriteSdi(playBuf, 2);
  }

  /* That's it. Now we've played the file as we should, and left VS10xx
     in a stable state. It is now safe to call this function again for
     the next song, and again, and again... */
  printf("ok\n");
  f_close(readFp);
}

u_int8 adpcmHeader[60] = {'R',  'I',  'F',  'F',  0xFF, 0xFF, 0xFF, 0xFF,
                          'W',  'A',  'V',  'E',  'f',  'm',  't',  ' ',
                          0x14, 0,    0,    0,    /* 20 */
                          0x11, 0,                /* IMA ADPCM */
                          0x1,  0,                /* chan */
                          0x0,  0x0,  0x0,  0x0,  /* sampleRate */
                          0x0,  0x0,  0x0,  0x0,  /* byteRate */
                          0,    1,                /* blockAlign */
                          4,    0,                /* bitsPerSample */
                          2,    0,                /* byteExtraData */
                          0xf9, 0x1,              /* samplesPerBlock = 505 */
                          'f',  'a',  'c',  't',  /* subChunk2Id */
                          0x4,  0,    0,    0,    /* subChunk2Size */
                          0xFF, 0xFF, 0xFF, 0xFF, /* numOfSamples */
                          'd',  'a',  't',  'a',  0xFF, 0xFF, 0xFF, 0xFF};

u_int8 pcmHeader[44] = {'R',  'I', 'F', 'F', 0xFF, 0xFF, 0xFF, 0xFF,
                        'W',  'A', 'V', 'E', 'f',  'm',  't',  ' ',
                        0x10, 0,   0,   0,   /* 16 */
                        0x1,  0,             /* PCM */
                        0x1,  0,             /* chan */
                        0x0,  0x0, 0x0, 0x0, /* sampleRate */
                        0x0,  0x0, 0x0, 0x0, /* byteRate */
                        2,    0,             /* blockAlign */
                        0x10, 0,             /* bitsPerSample */
                        'd',  'a', 't', 'a', 0xFF, 0xFF, 0xFF, 0xFF};

void Set32(u_int8 *d, u_int32 n) {
  int i;
  for (i = 0; i < 4; i++) {
    *d++ = (u_int8)n;
    n >>= 8;
  }
}

void Set16(u_int8 *d, u_int16 n) {
  int i;
  for (i = 0; i < 2; i++) {
    *d++ = (u_int8)n;
    n >>= 8;
  }
}

/*
  This function records an audio file in Ogg, MP3, or WAV formats.
  If recording in WAV format, it updates the RIFF length headers
  after recording has finished.
*/
void VS1053RecordFile(FILE *writeFp) {
  static u_int8 recBuf[REC_BUFFER_SIZE];
  u_int32 nextReportPos = 0; // File pointer where to next collect/report
  u_int32 fileSize = 0;
  // int volLevel = ReadSci(SCI_VOL) & 0xFF;
  // int c;
  int ch = 2;
  int adpcm = 0;
  int dataNeededInBuffer = REC_BUFFER_SIZE; /* max size of IMA ADPCM block */
  int adpcmBlocksPerWrite = 2 / ch;
  u_int32 adpcmBlocks = 0;
  u_int16 sampleRate = 8000;

  playerState = psPlayback;

  printf("VS1053RecordFile\n");

  /* Initialize recording */

  /* Set clock to a known, high value. */
  WriteSci(SCI_CLOCKF,
           HZ_TO_SC_FREQ(12288000) | SC_MULT_53_45X | SC_ADD_53_00X);

#if 1
  /* Ogg Vorbis recording from line in. */
  dataNeededInBuffer = 2;

  /* First reset VS1053 to remove any patches. */
  WriteSci(SCI_MODE, ReadSci(SCI_MODE) | SM_RESET);

  /* Disable interrupts as instructed in the VS1053b Ogg Vorbis Encoder
     documentation. */
  WriteVS10xxMem(0xc01a, 0x2);

  /* Load the plugin */
  LoadPlugin(encoderPlugin, sizeof(encoderPlugin) / sizeof(encoderPlugin[0]));

  /* Turn SCI_MODE bits. */
  WriteSci(SCI_MODE, ReadSci(SCI_MODE) | SM_ADPCM | SM_LINE1);

  WriteSci(SCI_RECGAIN, 1024); /* 1024 = gain 1 = best quality */
  WriteSci(SCI_AICTRL3, 0);

  /* Activate recording */
  WriteSci(SCI_AIADDR, 0x34);

  /* Check what samplerate the plugin is running the ADC. This is not
     necessarily the same as recording samplerate. E.g. at a 44100 Hz
     profile this will read as 48000 Hz. */
  sampleRate = ReadSci(SCI_AUDATA) & ~1;

  /* Reset VU meter */
  WriteSci(SCI_AICTRL0, 0x8080);

  audioFormat = afOggVorbis;
#elif 1
  /* Voice quality ADPCM recording from left channel at 8 kHz.
     This will result in a 32.44 kbit/s bitstream. */
  sampleRate = 8000;
  ch = 1;

  adpcmBlocksPerWrite = 2 / ch;
  adpcm = 1;

  WriteSci(SCI_RECRATE, sampleRate);
  WriteSci(SCI_RECGAIN, 0);       /* 1024 = gain 1 = best quality */
  WriteSci(SCI_RECMAXAUTO, 4096); /* if RECGAIN = 0, define max auto gain */
  if (ch == 2) {
    WriteSci(SCI_RECMODE,
             RM_53_FORMAT_IMA_ADPCM | RM_53_ADC_MODE_JOINT_AGC_STEREO);
  } else {
    WriteSci(SCI_RECMODE, RM_53_FORMAT_IMA_ADPCM | RM_53_ADC_MODE_LEFT);
  }
  /* Fill values according to VS1053b Datasheet Chapter "Adding
     an IMA ADPCM RIFF Header". */
  Set16(adpcmHeader + 22, ch);
  Set32(adpcmHeader + 24, sampleRate);
  Set32(adpcmHeader + 28, (u_int32)sampleRate * ch * 256 / 505);
  Set16(adpcmHeader + 32, 256 * ch);
  fwrite(adpcmHeader, sizeof(adpcmHeader), 1, writeFp);
  fileSize = sizeof(adpcmHeader);

  /* Start the encoder */
  WriteSci(SCI_MODE, ReadSci(SCI_MODE) | SM_LINE1 | SM_ADPCM | SM_RESET);
  LoadPlugin(imaFix, sizeof(imaFix) / sizeof(imaFix[0]));

  audioFormat = afRiff;
#else
  /* HiFi stereo quality PCM recording in stereo 48 kHz.
     This will result in a really fast 1536 kbit/s bitstream. Because
     there is a 100% overhead in reading from SCI, and because the data
     often has to be written to an SD card or similar using the same
     bus, the SPi speed must be really high and the software streamlined
     for there to be a chance for uninterrupted recording.

     For the absolute best quality possible on VS1053, you should use
     the VS1053 WAV PCM Recorder Application, available at
     http://www.vlsi.fi/en/support/software/vs10xxapplications.html */
  sampleRate = 48000;
  ch = 2;

  WriteSci(SCI_RECRATE, sampleRate);
  WriteSci(SCI_RECGAIN, 0);       /* 1024 = gain 1 = best quality */
  WriteSci(SCI_RECMAXAUTO, 4096); /* if RECGAIN = 0, define max auto gain */
  if (ch == 2) {
    WriteSci(SCI_RECMODE, RM_53_FORMAT_PCM | RM_53_ADC_MODE_JOINT_AGC_STEREO);
  } else {
    WriteSci(SCI_RECMODE, RM_53_FORMAT_PCM | RM_53_ADC_MODE_LEFT);
  }
  /* Fill values according to VS1053b Datasheet Chapter "Adding
     a PCM RIFF Header. */
  Set16(pcmHeader + 22, ch);
  Set32(pcmHeader + 24, sampleRate);
  Set32(pcmHeader + 28, 2L * sampleRate * ch);
  Set16(pcmHeader + 32, 2 * ch);
  fwrite(pcmHeader, sizeof(pcmHeader), 1, writeFp);
  fileSize = sizeof(pcmHeader);

