CMPE-146-MP3-Labs/Lab-Assignments/projects/lpc40xx_freertos/l5_application/VS1053/player1053.c
  /* Start the encoder */
  WriteSci(SCI_MODE, ReadSci(SCI_MODE) | SM_LINE1 | SM_ADPCM | SM_RESET);
  LoadPlugin(imaFix, sizeof(imaFix) / sizeof(imaFix[0]));

  audioFormat = afRiff;
#endif

#ifdef RECORDER_USER_INTERFACE
  SaveUIState();
#endif /* RECORDER_USER_INTERFACE */

  while (playerState != psStopped) {
    int n;

#ifdef RECORDER_USER_INTERFACE
    /* {
       c = GetUICommand();

       switch (c) {
       case 'q':
         if (playerState == psPlayback) {
           printf("\nSwitching encoder off...\n");
           if (audioFormat == afOggVorbis) {
             WriteSci(SCI_AICTRL3, ReadSci(SCI_AICTRL3) | 1);
             playerState = psUserRequestedCancel;
           } else {
             playerState = psStopped;
           }
         }
         break;
       case '-':
         if (volLevel < 255) {
           volLevel++;
           WriteSci(SCI_VOL, volLevel * 0x101);
         }
         break;
       case '+':
         if (volLevel) {
           volLevel--;
           WriteSci(SCI_VOL, volLevel * 0x101);
         }
         break;
         break;
       case '_':
         printf("\nvol %4.1f\n", -0.5 * volLevel);
         if (audioFormat == afOggVorbis) {
           printf("sampleCounter %ld\n", ReadVS10xxMem32Counter(0x1800));
         }
         break;
       case '?':
         printf("\nInteractive VS1053 file recorder keys:\n"
                "- +\tVolume down / up\n"
                "_\tShow current settings\n"
                "q\tQuit recording\n");
         break;
       default:
         if (c < -1) {
           printf("Ctrl-C, aborting\n");
           fflush(stdout);
           RestoreUIState();
           exit(EXIT_FAILURE);
         }
         if (c >= 0) {
           printf("\nUnknown char '%c' (%d)\n", isprint(c) ? c : '.', c);
         }
         break;
       }
     }*/
#endif /* RECORDER_USER_INTERFACE */

    /* See if there is some data available */
    if ((n = ReadSci(SCI_RECWORDS)) > dataNeededInBuffer) {
      int i;
      u_int8 *rbp = recBuf;

      if (audioFormat == afOggVorbis) {
        /* Always leave at least one word unread if Ogg Vorbis format */
        n = min(n - 1, REC_BUFFER_SIZE / 2);
      } else {
        /* Always writes one or two IMA ADPCM block(s) at a time */
        n = dataNeededInBuffer / 2;
        adpcmBlocks += adpcmBlocksPerWrite;
      }
      if (audioFormat == afOggVorbis || adpcm) {
        for (i = 0; i < n; i++) {
          u_int16 w = ReadSci(SCI_RECDATA);
          *rbp++ = (u_int8)(w >> 8);
          *rbp++ = (u_int8)(w & 0xFF);
        }
      } else {
        /* Make little-endian conversion for 16-bit PCM .WAV files */
        for (i = 0; i < n; i++) {
          u_int16 w = ReadSci(SCI_RECDATA);
          *rbp++ = (u_int8)(w & 0xFF);
          *rbp++ = (u_int8)(w >> 8);
        }
      }
      fwrite(recBuf, 1, 2 * n, writeFp);
      fileSize += 2 * n;
    } else {
      /* This code is only for Ogg Vorbis recording. */
      if (playerState == psUserRequestedCancel && (ReadSci(SCI_AICTRL3) & 2)) {
        playerState = psStopped;
      }
    }

    if (fileSize - nextReportPos >= REPORT_INTERVAL) {
      nextReportPos += REPORT_INTERVAL;
      printf("\r%ldKiB ", fileSize / 1024);
      if (audioFormat == afOggVorbis) {
        printf("%lds ", ReadVS10xxMem32Counter(0x8));
      }
      printf("%uHz %s %s ", sampleRate, (ch == 2) ? "stereo" : "mono",
             afName[audioFormat]);
      if (audioFormat == afOggVorbis) {
        printf("%3.1f kbit/s, ", ReadVS10xxMem32(0xC) * 0.001);
        /* Read VU meter and determine from here if the Ogg file has been
           stereo or mono. */
        u_int16 lr = ReadSci(SCI_AICTRL0);
        if ((lr & 0x8080) == 0x8080) {
          printf("l ???dB, r ???dB %04x ", lr);
        } else {
          WriteSci(SCI_AICTRL0, 0x8080);
          if (lr & 0x80) {
            ch = 1;
            printf("vu %3ddB ", LinToDB(lr & 0x7F00) - 95);
          } else {
            ch = 2;
            printf("l %3ddB, r %3ddB ", LinToDB(lr & 0x7F00) - 95,
                   LinToDB(256 * (lr & 0x7F)) - 95);
          }
        }
      }
      fflush(stdout);
    }
  } /* while (playerState != psStopped) */

  if (audioFormat == afOggVorbis) {
    /* Correctly read and write final bytes of an Ogg Vorbis file */
    int wordsLeft = ReadSci(SCI_RECWORDS);
    while (wordsLeft--) {
      u_int16 w = ReadSci(SCI_RECDATA);
      u_int16 toWrite = 2;
      recBuf[0] = (u_int8)(w >> 8);
      recBuf[1] = (u_int8)(w & 0xFF);
      if (!wordsLeft) {
        ReadSci(SCI_AICTRL3);
        w = ReadSci(SCI_AICTRL3);
        if (w & 4) {
          toWrite = 1;
          printf("\nOdd length Ogg Vorbis recording\n");
        } else {
          printf("\nEven length Ogg Vorbis recording\n");
        }
      }
      fwrite(recBuf, 1, toWrite, writeFp);
    }
  } else if (adpcm) {
    /* Update file sizes for an RIFF IMA ADPCM .WAV file */
    fseek(writeFp, 0, SEEK_SET);
    Set32(adpcmHeader + 4, fileSize - 8);
    Set32(adpcmHeader + 48, adpcmBlocks * 505);
    Set32(adpcmHeader + 56, fileSize - 60);
    fwrite(adpcmHeader, sizeof(adpcmHeader), 1, writeFp);
  } else {
    /* Update file sizes for an RIFF PCM .WAV file */
    fseek(writeFp, 0, SEEK_SET);
    Set32(pcmHeader + 4, fileSize - 8);
    Set32(pcmHeader + 40, fileSize - 36);
    fwrite(pcmHeader, sizeof(pcmHeader), 1, writeFp);
  }

#ifdef RECORDER_USER_INTERFACE
  RestoreUIState();
#endif /* RECORDER_USER_INTERFACE */

  /* Finally, reset the VS10xx software, including realoading the
     patches package, to make sure everything is set up properly. */
  VSTestInitSoftware();

  printf("ok\n");
}

/*

  Hardware Initialization for VS1053.

*/
int VSTestInitHardware(void) {
  /* Write here your microcontroller code which puts VS10xx in hardware
     reset anc back (set xRESET to 0 for at least a few clock cycles,
     then to 1). */
  lpc_peripheral__turn_on_power_to(LPC_PERIPHERAL__SSP0);

  LPC_SSP0->CR0 = 7;        // 8-bit mode
  LPC_SSP0->CR1 = (1 << 1); // Enable SSP as Master

