CMPE-146-MP3-Labs/Lab-Assignments/projects/lpc40xx_freertos/l5_application/VS1053/player1053.c
  uint8_t divider = 2;
  const uint32_t cpu_clock_khz = clock__get_core_clock_hz() / 1000UL;

  // Keep scaling down divider until calculated is higher
  while (2000 < (cpu_clock_khz / divider) && divider <= 254) {
    divider += 2;
  }

  LPC_SSP0->CPSR = divider;

  gpio__construct_with_function(GPIO__PORT_0, 18, GPIO__FUNCTION_2);
  gpio__construct_with_function(GPIO__PORT_0, 15, GPIO__FUNCTION_2);
  gpio__construct_with_function(GPIO__PORT_0, 17, GPIO__FUNCTION_2);
  VS_DREQ;
  gpio__set(VS_XRESET);
  gpio__set(VS_CS);
  gpio__set(VS_DCS);
  vTaskDelay(2);
  gpio__reset(VS_XRESET);
  vTaskDelay(2);
  gpio__set(VS_XRESET);
  vTaskDelay(2);
  return 0;
}

/* Note: code SS_VER=2 is used for both VS1002 and VS1011e */
const u_int16 chipNumber[16] = {1001, 1011, 1011, 1003, 1053, 1033, 1063, 1103,
                                0,    0,    0,    0,    0,    0,    0,    0};

/*

  Software Initialization for VS1053.

  Note that you need to check whether SM_SDISHARE should be set in
  your application or not.

*/
int VSTestInitSoftware(void) {
  u_int16 ssVer;

  /* Start initialization with a dummy read, which makes sure our
     microcontoller chips selects and everything are where they
     are supposed to be and that VS10xx's SCI bus is in a known state. */
  ReadSci(SCI_MODE);

  /* First real operation is a software reset. After the software
     reset we know what the status of the IC is. You need, depending
     on your application, either set or not set SM_SDISHARE. See the
     Datasheet for details. */
  WriteSci(SCI_MODE, SM_SDINEW | SM_TESTS | SM_RESET);

  /* A quick sanity check: write to two registers, then test if we
     get the same results. Note that if you use a too high SPI
     speed, the MSB is the most likely to fail when read again. */
  WriteSci(SCI_AICTRL1, 0xABAD);
  WriteSci(SCI_AICTRL2, 0x7E57);
  if (ReadSci(SCI_AICTRL1) != 0xABAD || ReadSci(SCI_AICTRL2) != 0x7E57) {
    printf("There is something wrong with VS10xx SCI registers: %x %x\n",
           ReadSci(SCI_AICTRL1), ReadSci(SCI_AICTRL2));

    return 1;
  }
  WriteSci(SCI_AICTRL1, 0);
  WriteSci(SCI_AICTRL2, 0);

  /* Check VS10xx type */
  ssVer = ((ReadSci(SCI_STATUS) >> 4) & 15);
  if (chipNumber[ssVer]) {
    fprintf(stderr, "Chip is VS%d\n", chipNumber[ssVer]);
    if (chipNumber[ssVer] != 1053) {
      printf("Incorrect chip\n");
      return 1;
    }
  } else {
    printf("Unknown VS10xx SCI_MODE field SS_VER = %d\n", ssVer);
    return 1;
  }

  /* Set the clock. Until this point we need to run SPI slow so that
     we do not exceed the maximum speeds mentioned in
     Chapter SPI Timing Diagram in the Datasheet. */
  WriteSci(SCI_CLOCKF,
           HZ_TO_SC_FREQ(12288000) | SC_MULT_53_35X | SC_ADD_53_10X);

  /* Now when we have upped the VS10xx clock speed, the microcontroller
     SPI bus can run faster. Do that before you start playing or
     recording files. */

  /* Set up other parameters. */
  WriteVS10xxMem(PAR_CONFIG1, PAR_CONFIG1_AAC_SBR_SELECTIVE_UPSAMPLE);

  /* Set volume level at -6 dB of maximum */
  WriteSci(SCI_VOL, 0x0c0c);

  /* Now it's time to load the proper patch set. */
  LoadPlugin(plugin, sizeof(plugin) / sizeof(plugin[0]));

  /* We're ready to go. */
  fprintf(stderr, "LOADED\n");
  return 0;
}

/*
  Main function that activates either playback or recording.
*/
int VSTestHandleFile(songname_t *fileName, int record) {
  if (!record) {
    FIL fp;
    int result = 0;
    result = f_open(&fp, (const char *)fileName, FA_OPEN_EXISTING | FA_READ);
    printf("Play file %s\n", (const char *)fileName);
    if (result == 0) {
      VS1053PlayFile(&fp);
    } else {
      printf("Failed opening %s for reading\n", (const char *)fileName);
      printf("Error Code: %i\n", result);
      return -1;
    }
  } else {
    FILE *fp = fopen((const char *)fileName, "wb");
    printf("Record file %s\n", (const char *)fileName);
    if (fp) {
      VS1053RecordFile(fp);
    } else {
      printf("Failed opening %s for writing\n", (const char *)fileName);
      return -1;
    }
  }
  return 0;
}
